src/main/resources/templates/CreateCLientV4.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:wsin="http://www.openwaygroup.com/wsint">
    <soapenv:Header>
        <wsin:SessionContextStr>?</wsin:SessionContextStr>
        <wsin:UserInfo>officer="WX_ADMIN"</wsin:UserInfo>
        <wsin:CorrelationId>?</wsin:CorrelationId>
    </soapenv:Header>
    <soapenv:Body>
        <wsin:CreateClientV4>
            <wsin:Reason>Create lient</wsin:Reason>
            <wsin:CreateClient_InObject>
                <wsin:InstitutionCode>0001</wsin:InstitutionCode>
                <wsin:Branch>001</wsin:Branch>
                <wsin:ClientTypeCode>PR</wsin:ClientTypeCode>
                <wsin:ShortName>Truong Ha Anh</wsin:ShortName>
                <wsin:FirstName>Anh</wsin:FirstName>
                <wsin:LastName>Truong</wsin:LastName>
                <wsin:MiddleName>Ha</wsin:MiddleName>
                <wsin:MaritalStatusCode>D</wsin:MaritalStatusCode>
                <wsin:SocialSecurityNumber>234550004319</wsin:SocialSecurityNumber>
                <wsin:SalutationCode>MR</wsin:SalutationCode>
                <wsin:BirthDate>2000-12-12</wsin:BirthDate>
                <wsin:Gender>F</wsin:Gender>
                <wsin:Citizenship>VNM</wsin:Citizenship>
                <wsin:IndividualTaxpayerNumber>43245665619</wsin:IndividualTaxpayerNumber>
                <wsin:CompanyName>OPenWay</wsin:CompanyName>
                <wsin:IdentityCardNumber>0997765539</wsin:IdentityCardNumber>
                <wsin:IdentityCardDetails>232445213hanoi</wsin:IdentityCardDetails>
                <wsin:ClientNumber>099773245419</wsin:ClientNumber>
                <wsin:Profession>Thu Ky</wsin:Profession>
                <wsin:EMail>linhdt@gmail.com</wsin:EMail>
                <wsin:AddressLine1>54 Lieu Giai Doi Can Ba Dinh</wsin:AddressLine1>
                <wsin:City>HaNoi</wsin:City>
                <wsin:HomePhone>0875433001</wsin:HomePhone>
                <wsin:MobilePhone>087543002</wsin:MobilePhone>
            </wsin:CreateClient_InObject>
        </wsin:CreateClientV4>
    </soapenv:Body>
</soapenv:Envelope>
